// Завдання 1

// Створити таймер, який буде починати відлік з 1 години та зменшувати час кожну хвилину. При досягненні 30 хвилин, таймер повинен відправляти повідомлення екран про те, що залишилось менше половини часу.
let time = 60;

const id = setInterval(() => {
    time -= 1;
    console.log("Виклик функції" + " " + time);
    if (time === 30) {
        alert("Залишилось менше половини часу");
    } else if (time === 0) {
        alert("Час вийшов");
        console.log("Виклик функції" + " " + time);
        clearInterval(id);
    }
}, 1000);